wxzed/ESP32_Display_Panel/src/drivers/lcd/port/esp_lcd_simple.h
/*
 * SPDX-FileCopyrightText: 2024-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
/**
 * @file
 * @brief ESP LCD: SIMPLE
 * 
 * This driver is designed for displays that don't require MIPI configuration commands.
 * It only sends display data without any initialization sequence.
 */

#pragma once

#include <stdint.h>
#include "soc/soc_caps.h"

#if SOC_MIPI_DSI_SUPPORTED
#include "esp_lcd_panel_vendor.h"
#include "esp_lcd_mipi_dsi.h"

#ifdef __cplusplus
extern "C" {
#endif

#define ESP_LCD_SIMPLE_VER_MAJOR    (1)
#define ESP_LCD_SIMPLE_VER_MINOR    (0)
#define ESP_LCD_SIMPLE_VER_PATCH    (0)

#define SIMPLE_CMD_GS_BIT (1 << 0)
#define SIMPLE_CMD_SS_BIT (1 << 1)

/**
 * @brief Create LCD panel for SIMPLE display controller
 *
 * @note This driver does not send any initialization commands, only display data.
 *       It's designed for displays that are pre-configured or don't need initialization.
 *
 * @param[in]  io LCD panel IO handle
 * @param[in]  panel_dev_config General panel device configuration
 * @param[out] ret_panel Returned LCD panel handle
 * @return
 *      - ESP_ERR_INVALID_ARG   if parameter is invalid
 *      - ESP_OK                on success
 *      - Otherwise             on fail
 */
esp_err_t esp_lcd_new_panel_simple(const esp_lcd_panel_io_handle_t io, const esp_lcd_panel_dev_config_t *panel_dev_config,
                                   esp_lcd_panel_handle_t *ret_panel);

/**
 * @brief MIPI-DSI bus configuration structure for SIMPLE driver
 *
 */
#define SIMPLE_PANEL_BUS_DSI_1CH_CONFIG()              \
    {                                                    \
        .bus_id = 0,                                     \
        .num_data_lanes = 1,                             \
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,     \
        .lane_bit_rate_mbps = 1250,                      \
    }

/**
 * @brief MIPI-DBI panel IO configuration structure for SIMPLE driver
 *
 */
#define SIMPLE_PANEL_IO_DBI_CONFIG()  \
    {                                   \
        .virtual_channel = 0,           \
        .lcd_cmd_bits = 8,              \
        .lcd_param_bits = 8,            \
    }

/**
 * @brief MIPI DPI configuration structure for SIMPLE driver
 *
 * @note  refresh_rate = (dpi_clock_freq_mhz * 1000000) / (h_res + hsync_pulse_width + hsync_back_porch + hsync_front_porch)
 *                                                      / (v_res + vsync_pulse_width + vsync_back_porch + vsync_front_porch)
 *
 * @param[in] px_format Pixel format of the panel
 *
 */
#define SIMPLE_800_480_PANEL_30HZ_DPI_CONFIG(px_format) \
    {                                                      \
        .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,       \
        .dpi_clock_freq_mhz = 30,                          \
        .virtual_channel = 0,                              \
        .pixel_format = px_format,                         \
        .num_fbs = 1,                                      \
        .video_timing = {                                  \
            .h_size = 800,                                 \
            .v_size = 480,                                \
            .hsync_back_porch = 45,                       \
            .hsync_pulse_width = 2,                       \
            .hsync_front_porch = 131,                       \
            .vsync_back_porch = 22,                        \
            .vsync_pulse_width = 2,                        \
            .vsync_front_porch = 7,                       \
        },                                                 \
        .flags.use_dma2d = true,                           \
    }

#ifdef __cplusplus
}
#endif
#endif // SOC_MIPI_DSI_SUPPORTED
